In [43]:
import pandas as pd
import numpy as np

from sqlalchemy import create_engine
from getpass import getpass

In [44]:
password = getpass()

In [45]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [46]:
rented_may = pd.DataFrame(engine.execute('''
SELECT film.title, COUNT(rental_date) AS rented
FROM film
LEFT JOIN
    (SELECT film_id, title, rental_date
    FROM film
    JOIN inventory USING (film_id)
    JOIN rental r USING (inventory_id)
    WHERE DATE_FORMAT(CONVERT(rental_date, DATE), '%%Y %%M') = '2005 May') sub
    USING (film_id)
GROUP BY film.title;
'''))
rented_may

                 title  rented
0     ACADEMY DINOSAUR       2
1       ACE GOLDFINGER       0
2     ADAPTATION HOLES       1
3     AFFAIR PREJUDICE       2
4          AFRICAN EGG       1
..                 ...     ...
995     YOUNG LANGUAGE       0
996         YOUTH KICK       0
997       ZHIVAGO CORE       1
998  ZOOLANDER FICTION       1
999          ZORRO ARK       3

[1000 rows x 2 columns]

In [47]:
rented_may_io = rented_may
rented_may_io['rented'] = rented_may['rented'].apply(lambda x: 1 if x>0 else 0)
rented_may_io

                 title  rented
0     ACADEMY DINOSAUR       1
1       ACE GOLDFINGER       0
2     ADAPTATION HOLES       1
3     AFFAIR PREJUDICE       1
4          AFRICAN EGG       1
..                 ...     ...
995     YOUNG LANGUAGE       0
996         YOUTH KICK       0
997       ZHIVAGO CORE       1
998  ZOOLANDER FICTION       1
999          ZORRO ARK       1

[1000 rows x 2 columns]

In [48]:
rented_june = pd.DataFrame(engine.execute('''
SELECT film.title, COUNT(rental_date) AS rented
FROM film
LEFT JOIN
    (SELECT film_id, title, rental_date
    FROM film
    JOIN inventory USING (film_id)
    JOIN rental r USING (inventory_id)
    WHERE DATE_FORMAT(CONVERT(rental_date, DATE), '%%Y %%M') = '2005 May') sub
    USING (film_id)
GROUP BY film.title;
'''))

rented_june_io = rented_june
rented_june_io['rented'] = rented_june['rented'].apply(lambda x: 1 if x>0 else 0)

In [71]:
film_bonus = pd.DataFrame(engine.execute('''
SELECT title, special_features
FROM film
ORDER BY title;
'''))
film_bonus = film_bonus['special_features'].str.get_dummies(sep=',')

,title,Behind the Scenes,Commentaries,Deleted Scenes,Trailers
0,ACADEMY DINOSAUR,1,0,1,0
1,ACE GOLDFINGER,0,0,1,1
2,ADAPTATION HOLES,0,0,1,1
3,AFFAIR PREJUDICE,1,1,0,0
4,AFRICAN EGG,0,0,1,0
...,...,...,...,...,...
995,YOUNG LANGUAGE,1,0,0,1
996,YOUTH KICK,1,0,0,1
997,ZHIVAGO CORE,0,0,1,0
998,ZOOLANDER FICTION,0,0,1,1
999,ZORRO ARK,1,1,0,1

In [50]:
film_categories = pd.DataFrame(engine.execute('''
SELECT f.title, c.name
FROM film f
JOIN film_category fa USING (film_id)
JOIN category c USING (category_id)
GROUP BY f.title, c.name
ORDER BY f.title;
'''))
film_categories.name.unique()

array(['Documentary', 'Horror', 'Family', 'Foreign', 'Comedy', 'Sports',
       'Music', 'Classics', 'Animation', 'Action', 'New', 'Sci-Fi',
       'Drama', 'Travel', 'Games', 'Children'], dtype=object)

In [51]:
film_ratings = pd.DataFrame(engine.execute('''
SELECT f.title, f.rating
FROM film f;
'''))
film_ratings.rating.unique()

array(['PG', 'G', 'NC-17', 'PG-13', 'R'], dtype=object)

In [52]:
film_lens = pd.DataFrame(engine.execute('''
SELECT f.title, f.length
FROM film f;
'''))
film_lens.isna().sum()

title     0
length    0
dtype: int64

In [53]:
film_durations = pd.DataFrame(engine.execute('''
SELECT f.title, f.rental_duration
FROM film f;
'''))
film_durations

                 title  rental_duration
0     ACADEMY DINOSAUR                6
1       ACE GOLDFINGER                3
2     ADAPTATION HOLES                7
3     AFFAIR PREJUDICE                5
4          AFRICAN EGG                6
..                 ...              ...
995     YOUNG LANGUAGE                6
996         YOUTH KICK                4
997       ZHIVAGO CORE                6
998  ZOOLANDER FICTION                5
999          ZORRO ARK                3

[1000 rows x 2 columns]

In [54]:
film_rates = pd.DataFrame(engine.execute('''
SELECT f.title, f.rental_rate
FROM film f;
'''))
film_rates.rental_rate = film_rates.rental_rate.astype(float)
film_rates

                 title  rental_rate
0     ACADEMY DINOSAUR         0.99
1       ACE GOLDFINGER         4.99
2     ADAPTATION HOLES         2.99
3     AFFAIR PREJUDICE         2.99
4          AFRICAN EGG         2.99
..                 ...          ...
995     YOUNG LANGUAGE         0.99
996         YOUTH KICK         0.99
997       ZHIVAGO CORE         0.99
998  ZOOLANDER FICTION         2.99
999          ZORRO ARK         4.99

[1000 rows x 2 columns]

In [55]:
film_pays_may = pd.DataFrame(engine.execute('''
SELECT film.title, avg_price
FROM film
LEFT JOIN
    (SELECT f.film_id, f.title, AVG(p.amount) AS avg_price
    FROM film f
    JOIN inventory i ON i.film_id = f.film_id
    JOIN rental r ON r.inventory_id = i.inventory_id
    JOIN payment p ON p.rental_id = r.rental_id
    WHERE DATE_FORMAT(CONVERT(rental_date, DATE), '%%Y %%M') = '2005 May'
    GROUP BY f.title, f.film_id) sub
    USING (film_id);
'''))
film_pays_may.avg_price = film_pays_may.avg_price.astype(float)
film_pays_may

                 title  avg_price
0     ACADEMY DINOSAUR       1.49
1       ACE GOLDFINGER        NaN
2     ADAPTATION HOLES       2.99
3     AFFAIR PREJUDICE       3.99
4          AFRICAN EGG       3.99
..                 ...        ...
995     YOUNG LANGUAGE        NaN
996         YOUTH KICK        NaN
997       ZHIVAGO CORE       2.99
998  ZOOLANDER FICTION       2.99
999          ZORRO ARK       4.99

[1000 rows x 2 columns]

In [56]:
film_pays_june = pd.DataFrame(engine.execute('''
SELECT film.title, avg_price
FROM film
LEFT JOIN
    (SELECT f.film_id, f.title, AVG(p.amount) AS avg_price
    FROM film f
    JOIN inventory i ON i.film_id = f.film_id
    JOIN rental r ON r.inventory_id = i.inventory_id
    JOIN payment p ON p.rental_id = r.rental_id
    WHERE DATE_FORMAT(CONVERT(rental_date, DATE), '%%Y %%M') = '2005 June'
    GROUP BY f.title, f.film_id) sub
    USING (film_id);
'''))
film_pays_june.avg_price = film_pays_june.avg_price.astype(float)
film_pays_june

                 title  avg_price
0     ACADEMY DINOSAUR   1.323333
1       ACE GOLDFINGER        NaN
2     ADAPTATION HOLES   2.990000
3     AFFAIR PREJUDICE   2.990000
4          AFRICAN EGG   4.490000
..                 ...        ...
995     YOUNG LANGUAGE   0.990000
996         YOUTH KICK   3.990000
997       ZHIVAGO CORE   1.990000
998  ZOOLANDER FICTION   3.490000
999          ZORRO ARK   6.390000

[1000 rows x 2 columns]

In [57]:
### when avg_price NaN ----> not rented in month
### DECISION: fill with -10

# film_pays_may['avg_price'] = film_pays_may['avg_price'].fillna(film_pays_may['avg_price'].max())
# film_pays_june['avg_price'] = film_pays_june['avg_price'].fillna(film_pays_june['avg_price'].max())
film_pays_may['avg_price'] = film_pays_may['avg_price'].fillna(-10)
film_pays_june['avg_price'] = film_pays_june['avg_price'].fillna(-10)
film_pays_may.isna().sum()

title        0
avg_price    0
dtype: int64

In [58]:
film_nums = pd.concat((film_lens.length, film_rates.rental_rate, film_durations.rental_duration), axis=1)
film_nums

     length  rental_rate  rental_duration
0        86         0.99                6
1        48         4.99                3
2        50         2.99                7
3       117         2.99                5
4       130         2.99                6
..      ...          ...              ...
995     183         0.99                6
996     179         0.99                4
997     105         0.99                6
998     101         2.99                5
999      50         4.99                3

[1000 rows x 3 columns]

In [59]:
from sklearn.preprocessing import OneHotEncoder

film_cats = pd.concat((film_categories.name, film_ratings.rating), axis=1)
film_cats

encoder = OneHotEncoder(drop='first').fit(pd.DataFrame(film_cats))
encoded = encoder.transform(pd.DataFrame(film_cats)).toarray()

cols = encoder.get_feature_names_out(input_features=film_cats.columns)

onehot_encoded_cats = pd.DataFrame(encoded, columns=cols).astype(object)
onehot_encoded_cats

,name_Animation,name_Children,name_Classics,name_Comedy,name_Documentary,name_Drama,name_Family,name_Foreign,name_Games,name_Horror,name_Music,name_New,name_Sci-Fi,name_Sports,name_Travel,rating_NC-17,rating_PG,rating_PG-13,rating_R
0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
996,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
997,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
998,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
999,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0

In [60]:
from sklearn.model_selection import train_test_split  

X = pd.concat((film_nums, onehot_encoded_cats), axis=1)
y = rented_may_io['rented']

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)
y_train = y_train.reset_index(drop=True)
y_test = y_test.reset_index(drop=True)
X_num_train = X_train.select_dtypes(include=np.number).reset_index(drop=True)
X_num_test = X_test.select_dtypes(include=np.number).reset_index(drop=True)
X_cat_train = X_train.select_dtypes(include=object).reset_index(drop=True).astype(float)
X_cat_test = X_test.select_dtypes(include=object).reset_index(drop=True).astype(float)

In [61]:
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler().fit(X_num_train)
X_train_norm = scaler.transform(X_num_train)
X_train_norm = pd.DataFrame(X_train_norm,columns=X_num_train.columns)

X_test_norm = scaler.transform(X_num_test)
X_test_norm = pd.DataFrame(X_test_norm,columns=X_num_train.columns)

X_train_final = pd.concat((X_train_norm, X_cat_train), axis=1)
X_test_final = pd.concat((X_test_norm, X_cat_test), axis=1)
X_test_final

,length,rental_rate,rental_duration,name_Animation,name_Children,name_Classics,name_Comedy,name_Documentary,name_Drama,name_Family,...,name_Horror,name_Music,name_New,name_Sci-Fi,name_Sports,name_Travel,rating_NC-17,rating_PG,rating_PG-13,rating_R
0,0.654676,0.5,0.25,0.0,0.0,0.0,1.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
1,0.949640,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0
2,0.251799,0.0,1.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,1.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
3,0.798561,1.0,0.50,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0
4,0.402878,1.0,0.75,0.0,0.0,0.0,0.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
195,0.093525,1.0,0.00,0.0,1.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
196,0.575540,0.5,1.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
197,0.381295,0.5,0.75,0.0,0.0,0.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
198,0.949640,1.0,0.50,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0
199,0.489209,0.0,0.50,0.0,0.0,0.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0

In [62]:
corr = pd.concat((X_num_train, y_train) ,axis=1).corr()
corr.rented.sort_values()

rental_duration   -0.074931
rental_rate       -0.017405
length             0.011100
rented             1.000000
Name: rented, dtype: float64

In [63]:
from sklearn.linear_model import LogisticRegression

classification = LogisticRegression(random_state=0, solver='saga',
                  multi_class='multinomial').fit(X_train_final, y_train)

predictions = classification.predict(X_train_final)
print(classification.score(X_train_final, y_train))

predictions_test = classification.predict(X_test_final)
print(classification.score(X_test_final, y_test))

0.69125
0.675

In [64]:
y2 = rented_june_io['rented']

film_nums2 = pd.concat((film_lens.length, film_rates.rental_rate, film_durations.rental_duration), axis=1)
X2 = pd.concat((film_nums2, onehot_encoded_cats), axis=1)
X2

,length,rental_rate,rental_duration,name_Animation,name_Children,name_Classics,name_Comedy,name_Documentary,name_Drama,name_Family,...,name_Horror,name_Music,name_New,name_Sci-Fi,name_Sports,name_Travel,rating_NC-17,rating_PG,rating_PG-13,rating_R
0,86,0.99,6,0.0,0.0,0.0,0.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
1,48,4.99,3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,50,2.99,7,0.0,0.0,0.0,0.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
3,117,2.99,5,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,130,2.99,6,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,183,0.99,6,0.0,0.0,0.0,0.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
996,179,0.99,4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,1.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
997,105,0.99,6,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,1.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
998,101,2.99,5,0.0,1.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
999,50,4.99,3,0.0,0.0,0.0,1.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0

In [65]:
predictions2 = classification.predict(X2)
print(classification.score(X2, y2))

0.686

In [66]:
from sklearn.metrics import confusion_matrix

confusion_matrix(y2, predictions2)          # with avg_price NaN to 0   ---> array([[118, 196],     
                                            #                                       [ 27, 659]]) 
                                            # higher precision but lower recall !

array([[  0, 314],
       [  0, 686]])

In [67]:
from sklearn.metrics import recall_score
from sklearn.metrics import precision_score

precision_score(y2, predictions2)
recall_score(y2, predictions2)

1.0

In [68]:
from sklearn.neighbors import KNeighborsClassifier

clf = KNeighborsClassifier(n_neighbors=3, weights='uniform')
clf.fit(X_train_final, y_train)
predictions_clf = clf.predict(X2)
clf.score(X2, y2)

0.686

In [69]:
confusion_matrix(y2, predictions_clf)

array([[  0, 314],
       [  0, 686]])